<template>
  <div class="columns is-gapless">
    <!-- Left Gap -->
    <div class="column is-narrow w-24"></div>
    <!-- Center Column -->
    <div class="column">
      <h3>ご利用頂いている飲食店のみなさまの声</h3>
      <ul>
        <li>営業時間外でもテイクアウト注文が受付られるようになって、お客さまからとてもよろこばれています。お店としても機会損失がなくなりました。夜中に次の日の注文が入っていたのは驚きです。</li>
        <li>電話注文ではどうしても注文の聞き間違えがあり、お客さんにもご迷惑をかけていたのですが、オンラインになってから注文の間違いがなくなり、安心して調理に専念できます。</li>
				<li>注文が入った時にLINEや電話で知らせてくれるので、見落としがなくなりました！</li>
				<li>オンラインで手軽に決済できるようになり、お客さまにも喜ばれています。お店としても「おつりの用意」が不要になりました。 </li>
        <li>お客様の購入履歴もエクセルで確認できるので常連さん、リピーターさんののより的確な把握ができるようになりました。</li>
        <li>毎月の売上がエクセルで確認できて、記帳が楽になりました。日々の雑務を大幅に効率化でき、万年人手不足の当店の大きなサポーターです！</li>
        <li>おもちかえり.comを利用しはじめてみたら、初月で２０万円売上が立ちました。</li>
      </ul>
    </div>
    <div class="column is-narrow w-24"></div>
  </div>
</template>
<script>
export default {
}
</script>
