<template>
  <div>
    <!-- Back -->
    <div class="mx-6 mt-6 lg:mx-auto lg:max-w-2xl">
      <!-- Title -->
      <div class="mt-6 text-xl font-bold text-black text-opacity-30">
        ネット注文サービスのご利用について
      </div>
      <div v-for="(faq, k) in faqList" :key="k">
        <div class="mt-4 text-sm font-bold text-op-teal">
          <a :name="`index_` + k"></a>
          <a :href="`#faq_`+ k">
            ・ {{ faq.q }}
          </a>
        </div>
      </div>

      <div class="mt-6 rounded-lg bg-white px-4 pt-1 pb-4 shadow">
        <div v-for="(faq, k) in faqList" :key="k" class="mb-5">
          <div class="mt-4 mb-2 font-bold">
            <a :name="`faq_` + k">
              {{ faq.q }}
            </a>
            <a :href="`#index_`+ k">
              ↑
            </a>
          </div>
          <div v-for="(answer, j) in faq.answers" :key="j" class="mt-2 text-sm">
            {{ answer }}
          </div>
          <div class="mt-3">
            <div
              v-for="(note, i) in faq.notes"
              :key="i"
              class="mt-1 text-xs text-black text-opacity-50"
            >
              {{ note }}
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
import { defineComponent } from "@vue/composition-api";

export default defineComponent({
  setup() {
    const faqList = [
      {
        q: "ご利用の流れについて",
        answers: [
          "店舗一覧から受け取り店舗を選択後、商品を選択し「お会計」のボタンを押します。本人確認のために携帯電話のSMS（ショートメッセージサービス）を利用した認証が必要となります。",
          "確認コードをサイト内にて入力いただくことで受け渡し希望時刻の選択やお支払方法が選択でき、注文が完了します。",
        ],
      },
      {
        q: "受け渡し希望時刻について",
        answers: [
          "3日後よりご指定が可能です。また、店舗での受け渡し時間帯は午前10時から午後10時まで30分単位でご指定いただけます。",
        ],
      },
      {
        q: "販売価格/店舗で開催のキャンペーンについて",
        answers: ["販売されている価格はネット注文サービスの価格となります。"],
        notes: [
          "※「ご注文時にクレッジットカードでお支払い」にて注文をされている場合は店舗で実施しているキャンペーンは対象外となります。",
        ],
      },
      {
        q: "お取扱商品について",
        answers: ["店頭に在庫がない商品もお取り寄せによるご注文が可能です。"],
      },
      {
        q: "お支払い方法について",
        answers: [
          "「事前決済（クレッジットカード）でのお支払い」もしくは「受取時に店舗でのお支払い」",
          "事前クレジットカード払いで支払う際に、カード決済の処理が正しく完了しなかった場合は、商品受取時に店舗でのお支払いに変更させていただきます。その際には「決済処理が正しく完了できなかったため、カード決済を取り消しました。代金は受け取り時に店舗でお支払いください。」というSMS(ショートメッセージサービス）が配信されます。",
        ],
        notes: [
          "※CVC(セキュリティーコード)とは？",
          "Visa, MasterCard, JCB, Diners Club, DISCOVER：カードのうら面の右端3ケタ",
          "American Express：カードのおもて面の4ケタ",
        ],
      },
      {
        q: "ご注文商品のお受け取りについて",
        answers: [
          "お客様が指定した受け取り店舗、指定の日時に合わせてご注文商品の受け渡し準備をします。ご来店時に、事前に配信された携帯電話のSMS（ショートメッセージサービス）通知画面をご提示ください。また、SMS（ショートメッセージサービス）の画面を提示できない場合はスタッフより、注文番号と電話番号の下４桁を伺わせていただきます。ご来店前にご用意いただきますようお願い致します。また、店舗までの交通費など移動に関わる費用などは、ご負担下さい。",
        ],
      },
      {
        q: "ご注文のキャンセルについて",
        answers: [
          "【事前決済の場合】",
          "・お客様宛に「受付済み」のSMS通知が配信されるまでは、「注文履歴」よりご注文のキャンセルが可能です。",
          "・「受付済み」のSMS通知が配信された以降は、ご注文のキャンセルはできません。",
          "・「受付済み」のSMS通知が配信された注文であっても、売り切れ・過度の注文の集中・注文受付時のエラー・その他、店舗側の都合によりキャンセルさせていただく場合がございます。",
          "【店頭払いの場合】",
          "・お客様宛に「受け渡し準備完了」のSMS通知が配信されるまでは、「注文履歴」よりご注文のキャンセルが可能です。",
          "・「受け渡し準備完了」のSMS通知が配信された以降は、ご注文のキャンセルはできません。",
          "・「受付済み」のSMS通知が配信された注文であっても、売り切れ・過度の注文の集中・注文受付時のエラー・その他、店舗側の都合によりキャンセルさせていただく場合がございます。",
          "・「受け渡し準備完了」の表示から2時間を経過した場合には、店舗側でご注文をキャンセルさせていただく場合がございます。「事前決済（クレジットカード）でのお支払い」で注文されている場合、「ご注文された商品代金相当額」をお支払いいただく必要がございます。",
          "・ご注文いただいた商品の内、販売終了などの都合によりご用意ができない商品があった場合は店舗よりご注文のキャンセルをさせていただく場合がございます。",
          "・その場合、ご登録いただきました電話番号にSMS（ショートメッセージサービスにて「お客様ご自身にてキャンセルされたか、商品のご用意ができなかった為、ご注文がキャンセルされました。」というメッセージが配信されます。",
        ],
      },
      {
        q: "ご注文商品の返品について",
        answers: [
          "お客様のご都合による返品は行っておりません。商品の間違いや汚破損があった際には、商品の交換または返金の対応をさせていただきます。受け取り店舗へお問い合わせください。",
        ],
      },
    ];
    return {
      faqList,
    };
  },
});
</script>
