<template>
  <div>
    <!-- Article Body Area -->
    <div class="columns is-gapless">
      <!-- Left Gap -->
      <div class="column is-narrow w-24"></div>
      <!-- Center Column -->
      <div class="column">
        <div class="columns is-gaplress">
          <div class="column is-three-fifths is-offset-one-fifth">
            <div class="m-l-24 m-r-24">
              <div class="m-t-24">
                <!-- Title -->
                <div class="t-h6 c-text-black-disabled">おもちかえり.com プライバシーポリシー</div>

                <!-- Date -->
                <!-- <div
                  class="t-subtitle1 c-text-black-disabled m-t-8"
                >{{ $t("menu.updated") }}: 2020.06.24</div>-->

                <!-- Body -->
                <div>
                  <section>
                    <h6>１. 本プライバシーポリシーについて</h6>
                    <p>本プライバシーポリシーは、「おもちかえり.comサービス利用規約」第2条第2項の「プライバシーポリシー」に含まれ、当社がWEBサービス「おもちかえり.com」を運営する上で、会員の個人情報の取り扱う際の指針を定めるものです。</p>
                  </section>

                  <section>
                    <h6>２. 個人情報の定義</h6>
                    <p>本プライバシーポリシーにおいて、個人情報とは、個人情報の保護に関する法律に規定される生存する個人に関する情報（氏名、生年月日、その他の特定の個人を識別することができる情報）及び特定の個人と結びついて使用されるメールアドレスその他の個人に関する属性情報をいいます。</p>
                  </section>

                  <section>
                    <h6>３. 個人情報取扱事業者の氏名又は名称</h6>
                    <p>一般社団法人シンギュラリティ・ソサエティ</p>
                  </section>

                  <section>
                    <h6>４. 収集する個人情報の項目</h6>
                    <p>当社は、次の各号に掲げる会員に関する個人情報を取得することがあります。</p>
                    <ol>
                      <li>氏名</li>
                      <li>住所</li>
                      <li>電話番号</li>
                      <li>メールアドレス</li>
                      <li>LINEアカウント</li>
                      <li>当社サービスの利用に必要な会員ID及びパスワードその他の情報</li>
                      <li>当社サービスの利用に関する取引履歴</li>
                      <li>加盟店への来店/退店履歴</li>
                      <li>当社へのお問い合わせやご連絡等に関する情報</li>
                      <li>
                        次に掲げる端末及びクッキー利用の際に取得する情報
                        <ol>
                          <li>情報通信端末の機体識別に関する情報</li>
                          <li>情報通信端末のOS情報</li>
                          <li>インターネットへの接続に関する情報</li>
                          <li>写真アプリ及び端末内ストレージの情報</li>
                          <li>位置情報</li>
                          <li>リファラ情報</li>
                          <li>IPアドレス情報</li>
                          <li>閲覧したURLおよび閲覧した日時に関するタイムスタンプ情報</li>
                          <li>サービスの利用に関する情報</li>
                          <li>利用者様の端末ごとに割り振られる広告識別子情報</li>
                          <li>サーバログ情報</li>
                        </ol>
                      </li>
                    </ol>
                  </section>

                  <section>
                    <h6>５. 収集する個人情報の利用目的</h6>
                    <p>当社は、次の各号に掲げる目的のために取得した個人情報を利用することがあります。</p>
                    <ol>
                      <li>当社サービスにおける会員アカウント管理のため</li>
                      <li>本人確認、認証のため</li>
                      <li>加盟店による商品販売、広告及び宣伝のため</li>
                      <li>サービスの運営上必要な事項の通知のため</li>
                      <li>サービスの開発、及びサービス向上を目的とした統計、分析、アンケート等のため</li>
                      <li>新型コロナウイルス感染症を含む感染症の感染経路調査のため</li>
                      <li>当社サービスに関するお問い合わせ、ご相談、苦情、その他の会員対応、並びに紛争の解決のため</li>
                      <li>不正又は違法行為の防止のため</li>
                    </ol>
                  </section>

                  <section>
                    <h6>６. 個人情報の適正な取得</h6>
                    <p>当社は、適法かつ適正に個人情報を取得し、偽りその他不正の手段により取得することはありません。</p>
                  </section>

                  <section>
                    <h6>７. 個人情報の管理等</h6>
                    <p>当社は、個人情報の漏洩、滅失またはき損の防止その他の個人情報の安全管理が図られるよう、適切な措置を講じます。</p>
                  </section>

                  <section>
                    <h6>８. 個人情報の第三者への提供</h6>
                    <p>当社は、次の各号に掲げる場合を除き、会員の個人情報を第三者（個人情報取扱いの委託先、及び合併その他の事由による事業承継先を除きます）に提供しません。</p>
                    <ol>
                      <li>会員の事前の同意を得た場合</li>
                      <li>法令に基づき会員が個人情報を提供する義務を負う場合</li>
                      <li>人の生命、身体または財産の保護のために必要がある場合であって、ご本人の同意を得ることが困難であるとき</li>
                      <li>公衆衛生の向上または児童の健全な育成の推進のために特に必要がある場合であって、ご本人の同意を得ることが困難であるとき</li>
                      <li>国の機関（裁判所、警察、検察等の機関を含みますがこれに限りません）もしくは地方公共団体またはその委託を受けた者が法令の定める事務を遂行することに対して協力する必要がある場合であって、ご本人の同意を得ることにより当該事務の遂行に支障を及ぼすおそれがあるとき</li>
                      <li>予め第三者に提供する旨を告知又は公表している場合</li>
                    </ol>
                  </section>

                  <section>
                    <h6>９. 個人情報の加盟店への提供</h6>
                    <p>会員が当社サービス上において、加盟店から商品を購入する場合、当社は、加盟店に対し、次のとおり個人情報を提供することがあります。会員は、当社サービス上において加盟店から商品を購入した時点で、当該個人情報の提供に同意したものとみなします。</p>
                    <ol>
                      <li>提供先: 当該商品の購入先である加盟店</li>
                      <li>
                        提供される情報: 氏名、メールアドレス、電話番号、LINEアカウント、住所、
                        会員ID
                      </li>
                      <li>提供方法: 当社サーバから提供先への自動送信による</li>
                      <li>利用目的: 購入商品の調理、引渡し、並びに加盟店の広告及び宣伝等のため</li>
                    </ol>
                  </section>

                  <section>
                    <h6>１０. 新型コロナウイルス感染症を含む感染症の感染経路調査協力のための提供</h6>
                    <p>会員が同意の上、当社サービス「COVID-19 Tracking」を利用する場合、当社は、加盟店に対し、次のとおり個人情報を提供することがあります。また、新型コロナウイルス感染症を含む感染症の感染経路調査に協力する必要がある場合に限り、加盟店に提供された当該個人情報は、加盟店を通じて、国もしくは地方公共団体またはその委託を受けた者に提供されることがあります。会員は、当社サービス「COVID-19 Tracking」を利用し、個人情報の登録をした時点で当該個人情報の提供に同意したものとみなします。</p>
                    <ol>
                      <li>
                        提供先:
                        <ol>
                          <li>当社サービス「COVID-19 Tracking」を利用した加盟店</li>
                          <li>国もしくは地方公共団体またはその委託を受けた者</li>
                        </ol>
                      </li>
                      <li>提供される情報: LINEアカウント、加盟店への来店/退店履歴</li>
                      <li>提供方法: 当社サーバから提供先への自動送信による</li>
                      <li>利用目的: 新型コロナウイルス感染症を含む感染症の感染経路調査のため</li>
                    </ol>
                  </section>

                  <section>
                    <h6>１１. 個人情報の開示、訂正及び利用停止、並びに個人情報の取扱いに関する苦情申出等</h6>
                    <p>会員がご自身の個人情報の開示、訂正及び利用停止などをご希望される場合の窓口、その他本プライバシーポリシーに関するお問合せの窓口は、次のとおりです。なお、個人情報の開示、訂正及び利用停止などをご希望される場合は、ご本人であることを確認の上、対応いたします。</p>
                    <div
                      class="bg-form r-8 m-t-24 p-l-16 p-r-16 p-t-16 p-b-16 t-body2 c-text-black-medium"
                    >
                      <div>【窓口】</div>
                      <div class="m-t-4">一般社団法人シンギュラリティ・ソサエティ</div>
                      <div class="m-t-4">個人情報取扱担当窓口</div>
                      <div class="is-inline-flex flex-center">
                        <span class="m-t-4">Eメール：</span>
                        <img src="~static/email-privacy.svg" />
                      </div>
                    </div>
                  </section>

                  <section>
                    <h6>１２. プライバシーポリシーの変更</h6>
                    <p>当社は、法改正や当社事業内容又はサービスの変更、会員の要望等により、会員へ事前に告知をした上、本プライバシーポリシーの内容を変更する事があります。事前の告知においては、変更内容及び効力発生日を通知いたします。</p>
                  </section>
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>
      <!-- Right Gap -->
      <div class="column is-narrow w-24"></div>
    </div>
  </div>
</template>

<script>
import { defaultHeader } from "../../plugins/header";

export default {
  head() {
    return {
      title: [ this.$t('pageTitle.terms.privacy') || "", defaultHeader.title].join(" / "),
    };
  }
}
</script>

<style lang="scss" scoped>
section {
  @extend .t-body2;
  @extend .c-text-black-medium;
}
h6 {
  @extend .t-subtitle1;
  @extend .c-text-black-disabled;
  @extend .m-t-24;
}

p {
  @extend .m-t-16;
}
ol {
  @extend .m-t-16;
  list-style: outside;
  list-style-type: decimal;
  padding-left: 24px;
}
li {
  @extend .m-t-8;
}
ol > li > ol {
  list-style-type: lower-alpha;
}
ol > li > ol > li > ol {
  list-style-type: lower-roman;
}
</style>
