<template>
  <div>
    <!-- Article Body Area -->
    <div class="columns is-gapless">
      <!-- Left Gap -->
      <div class="column is-narrow w-24"></div>
      <!-- Center Column -->
      <div class="column">
        <div class="columns is-gaplress">
          <div class="column is-three-fifths is-offset-one-fifth">
            <div class="m-l-24 m-r-24">
              <div class="m-t-24">
                <!-- Title -->
                <div class="t-h6 c-text-black-disabled">おもちかえり.com サービス利用規約（加盟店）</div>

                <!-- Date -->
                <!-- <div
                  class="t-subtitle1 c-text-black-disabled m-t-8"
                >{{ $t("menu.updated") }}: 2020.06.24</div>-->

                <!-- Body -->
                <div>
                  <section>
                    <h6>第1条（目的）</h6>
                    <p>一般社団法人シンギュラリティ・ソサエティ（以下「当社」と言う。）は、「テイクアウト商品事前注文・決済サービス」、「店舗向けの予約内容確認」及び「利用者の追跡」を行うことができるWEBサービス『おもちかえり.com』（以下「本サービス」と言う。）を提供し、加盟店が本サービスを利用して商品販売を行う。この規約（以下「本規約」と言う。）は、当社が提供する本サービスの利用に関し、当社と加盟店との間の契約関係を定めるものである。</p>
                  </section>

                  <section>
                    <h6>第2条（定義）</h6>
                    <ol>
                      <li>「本規約」とは、おもちかえり.comサービス利用規約（加盟店）、プライバシーポリシー、個別規約等をいい、これらはすべて本規約を構成するものとして適用される。</li>
                      <li>「プライバシーポリシー」とは、当社が定めるプライバシーポリシーをいう。</li>
                      <li>「個別規約等」とは、本サービスに関する個別の規約やルール等をいう。当社は、本サービスの提供にあたり、必要に応じて個別規約等を作成することができ、作成した個別規約等は、当社の定める方法で本サービス上に掲載又は会員に通知するものとする。</li>
                      <li>「会員」とは、当社が提供する本サービスを利用する者及び加盟店の商品を購入しようとする者をいう。</li>
                      <li>「出店」とは、加盟店が本規約の内容に同意し、当社の提供する本サービス上で自己の商品を会員に対して販売する目的で自己の情報及び商品の情報を掲載することをいう。</li>
                      <li>「加盟店」とは、第3条に定める申込を行い、当該申込の承諾を当社から得て、本サービス上に情報が掲載される者をいう。</li>
                      <li>「本サービス」とは、加盟店が本サービス上にて自己の商品を有料で提供する商品のテイクアウト、その他これに付随するサービスを提供するWEBサービスをいう。</li>
                      <li>「テイクアウト商品」とは、加盟店が本サービスに情報を掲載することによって会員に対して販売提供する飲料、食品、その他同種の商品をいう。</li>
                      <li>「出店ページ」とは、加盟店の情報及びテイクアウト商品情報の掲載、当社及び会員からの連絡の送受信、その他各種設定を行うページをいう。</li>
                      <li>「アカウント」とは、加盟店に対し当社が発行付与する出店ページ、及び当該出店ページにアクセスするために必要なID・パスワードをいう。</li>
                      <li>「心づけ」とは、会員が当サイト上､当サイトの加盟店に対し注文行為を行うにあたり、商品の代金に加えて、商品の提供に係るサービスの対価として、加盟店に対して支払われる金銭をいいます。</li>
                    </ol>
                  </section>

                  <section>
                    <h6>第3条（申込）</h6>
                    <ol>
                      <li>出店を希望する者（以下「出店希望者」と言う。）は、本規約に同意したうえで、当社所定の方法により当社に対し申込を行わなければならない。なお、申込にあたって、出店希望者は自身が本サービスに出店するために必要な法令上の手続き（食品営業許可申請等テイクアウト商品の提供に必要なものを指すがこれに限らない）を完了していることを保証するものとする。</li>
                      <li>
                        出店希望者の申し込みに対し、当社が承諾をした場合、出店希望者は出店をすることができる。以下のいずれかに該当すると当社が判断した場合、当社は、出店希望者の申込を拒絶するものとする。
                        <ol>
                          <li>当社に対し、虚偽の情報を提供したとき</li>
                          <li>当社所定の審査基準（なお、当社はかかる審査基準を開示する義務を負わない）を満たさないとき</li>
                          <li>その他、本サービスをご利用いただくことが適当でないと当社が判断したとき</li>
                        </ol>
                      </li>
                    </ol>
                  </section>

                  <section>
                    <h6>第4条（契約期間）</h6>
                    <p>本規約の契約期間は6カ月とし、当社又は加盟店の別段の申し出がない限り、6カ月毎に自動で更新されるものとする。</p>
                  </section>

                  <section>
                    <h6>第5条（利用解約）</h6>
                    <ol>
                      <li>加盟店が当社との契約を解除するためには、出店及び本サービスの利用を停止する日の14日前までに当社に対して解約の申し入れを書面又は電子メールで行わなければならない。</li>
                      <li>加盟店は解約の申し入れを行った後、当社が出店ページを削除し利用を停止するまで本規約によって義務付けられる加盟店の義務を履行しなければならない。</li>
                    </ol>
                  </section>

                  <section>
                    <h6>第6条（届出事項）</h6>
                    <p>加盟店は、第3条の申込に際し、以下の事項をあらかじめ当社に届け出るものとし、届出後に以下の事項に変更がある場合にも同様とする。加盟店が届出をしなかったことにより、加盟店が損害を被ったとしても、当社は一切の責任を負わないものとする。</p>
                    <ol>
                      <li>商号（屋号）、代表者名及び住所</li>
                      <li>出店についての責任者（以下「管理責任者」と言う。）の氏名、当社からの連絡を遅滞なく確認できる電子メールアドレス、電話番号その他当社所定の事項</li>
                      <li>その他当社が指定する加盟店の業務に関する事項</li>
                    </ol>
                  </section>

                  <section>
                    <h6>第7条（出店ページの開設）</h6>
                    <div>当社は、加盟店に対し、当社が指定する、当社サーバー内のURLに加盟店の出店ページを開設するとともに、出店ページにアクセスするために必要となるID及びパスワードを発行する（出店ページの開設日を以下「アカウント発行日」と言う。）。</div>
                  </section>

                  <section>
                    <h6>第8条（出店ページ情報の入稿）</h6>
                    <ol>
                      <li>加盟店は、当社の定める規格に従い、アカウント発行日から合理的期間内に、店舗やテイクアウト商品についての情報等（以下「コンテンツ」と言う。）を出店ページ上に制作する。</li>
                      <li>
                        加盟店は、前項のコンテンツの制作にあたり、次の事項を遵守するものとする。
                        <ol>
                          <li>第19条その他本規約等に反する表示をしないこと</li>
                          <li>わいせつ、グロテスクその他会員及び一般人が不快感を覚える表示をしないこと</li>
                          <li>テイクアウト商品に特定商取引に関する法律が適用されるか否かにかかわらず、同法11条及び同法施行規則8条により表示を義務づけられた事項について表示すること</li>
                          <li>
                            前号のほか、以下の事項について表示するとともに、随時最新の内容に更新すること
                            <ol>
                              <li>出店ページの管理責任者の氏名、電話番号及び電子メールアドレス</li>
                              <li>営業時間、定休日等</li>
                              <li>テイクアウト商品についての問合せ及び苦情を加盟店宛に行う旨の会員に対する案内</li>
                              <li>その他当社所定の事項</li>
                            </ol>
                          </li>
                        </ol>
                      </li>
                      <li>当社は、加盟店の制作したコンテンツについて当社の裁量によりその内容及び表示を変更することができる。</li>
                    </ol>
                  </section>

                  <section>
                    <h6>第9条（クレームの処理）</h6>
                    <ol>
                      <li>加盟店は、加盟店が制作したコンテンツ、加盟店の店頭でのサービス及び引き渡したテイクアウト商品に関する第三者からの問合せ、クレーム等について、自己の責任と費用負担をもって誠実に対応するものとし、当社は一切の責任を負わない。</li>
                      <li>加盟店は、加盟店が制作したコンテンツ、店頭でのサービス及び引き渡したテイクアウト商品に関して第三者から損害賠償請求、その他提訴を受け、又はそのおそれがある場合、直ちにその旨を当社に通知し、加盟店は自己の責任と費用負担によりこれを解決するものとする。この場合、当社が損害を被ったときは、加盟店は当社が被った一切の損害（弁護士費用含む。）を当社に賠償するものとする。</li>
                    </ol>
                  </section>

                  <section>
                    <h6>第10条（テイクアウト商品の売買契約の成立等）</h6>
                    <ol>
                      <li>加盟店と会員との間におけるテイクアウト商品の売買契約は、会員が本サービス上で行った注文を加盟店が本サービス上で承認したときに成立するものとする。</li>
                      <li>加盟店は、テイクアウト商品代金に加えて、「心づけ」（以下、「テイクアウト商品」と「心づけ」をあわせて、「テイクアウト商品等」と言う。）を会員から受け取ることができるものとする。</li>
                    </ol>
                  </section>

                  <section>
                    <h6>第11条（テイクアウト商品等の決済）</h6>加盟店は、第14条で定めるオンライン決済および加盟店が店舗で提供する通常の店舗決済（店舗決済の場合、現金、クレジットカード、その他の電子決済など。）のいずれかにより、テイクアウト商品等の決済を行う。
                    <ol>
                      <li>オンライン決済の場合、加盟店で調理が完了しご注文のテイクアウト商品のお渡しが可能となった場合、本サイトにて「調理済み」が表示され、その表示をもって取引の決済が完了となる｡</li>
                      <li>店舗決済の場合、現金、クレジットカード、その他の電子決済など、加盟店が店舗で提供する通常の決済方法により決済が完了となる。</li>
                    </ol>
                  </section>

                  <section>
                    <h6>第12条（テイクアウト商品の引渡しの完了）</h6>
                    <ol>
                      <li>加盟店は、第10条に基づいて会員との間で売買契約が成立したテイクアウト商品を、本サービス上で指定された時間までに、出店ページにおいて引渡し場所として定めた店舗に用意するものとする。本サービスを通じて注文を行った会員が、加盟店の店舗で該当のテイクアウト商品を受け取ったとき、引渡しが完了するものとする。</li>
                      <li>加盟店がテイクアウト商品を用意したにもかかわらず、調理済みの表示から2時間を経過しても会員がテイクアウト商品を取りに来なかった場合、引渡しは完了したものとみなす。なお、その場合、加盟店が加盟店の判断で当該テイクアウト商品を処分するものとする。</li>
                    </ol>
                  </section>

                  <section>
                    <h6>第13条（出店環境の整備）</h6>
                    <ol>
                      <li>加盟店は加盟店専用にwebにアクセスして本サービスにログインする端末を用意する。</li>
                      <li>加盟店は注文が常時確認できる状態に前項の端末をセッティングするものとする。注文の見落とし、テイクアウト商品の内容の誤り等は加盟店の責任とし、当社は一切の責任を負わないものとする。</li>
                    </ol>
                  </section>

                  <section>
                    <h6>第14条（売上金の決済方法）</h6>
                    <ol>
                      <li>本サービスでは加盟店と利用者間におけるテイクアウト商品等の代金の決済方法としてオンライン決済プラットフォーム「Stripe」を実装しており、加盟店が「Stripe」を利用する場合、加盟店は「Stripe」を提供するストライプジャパン株式会社（以下、「ストライプ社」と言います。）の定める利用規約に同意し、ストライプ社との間で別途、契約を締結するものとする。</li>
                      <li>加盟店が「Stripe」を利用した場合であっても、テイクアウト商品等の代金の決済及び支払いに関して当社は一切関与せず、当社はストライプ社及び加盟店に対し一切の責任を負わない。テイクアウト商品等の代金の授受及び支払についてトラブルが発生した場合、当該トラブルについて当社は一切責任を負わずストライプ社及び加盟店の責任と負担で解決するものとする。</li>
                      <li>加盟店が「Stripe」を利用した場合、加盟店は、ストライプ社に対し、加盟店と利用者との間におけるテイクアウト商品等の代金を加盟店に代わって受領する権限を付与し、ストライプ社は加盟店に代わって当該代金を利用者から受領するものとする。加盟店と利用者間におけるテイクアウト商品等の代金の決済等でトラブルが発生した場合、加盟店はストライプ社と協力して解決する。</li>
                    </ol>
                  </section>

                  <section>
                    <h6>第15条（売上金の支払）</h6>
                    <ol>
                      <li>加盟店はストライプ社との契約に基づき、ストライプ社よりテイクアウト商品等の売上金の支払いを受けるものとする。</li>
                      <li>テイクアウト商品等の代金の授受及び支払について、当社は一切関与せず、ストライプ社及び加盟店に対し一切責任を負わない。</li>
                    </ol>
                  </section>

                  <section>
                    <h6>第16条（営業についての確約事項）</h6>
                    <ol>
                      <li>加盟店は、出店ページにおいて自ら定めた営業日及び営業時間に従って本サービスを利用し、その間、会員がテイクアウト商品を常に購入できる体制を整えておかなければならない。</li>
                      <li>前項に違反する事実が3営業日（加盟店が出店ページに定めた営業日を基準とする）連続した場合、当社は、当該加盟店の営業状況及び本サービス、端末の利用状態の確認を求めることがある。この場合、加盟店は、当社の求めに応じて速やかに状況を報告するとともに、本サービスの利用に関して当社から指導があった場合にはこれに従うものとする。</li>
                    </ol>
                  </section>

                  <section>
                    <h6>第17条（利用者追跡機能の利用）</h6>
                    <p>加盟店は、当社が提供するQRコードを店内で飲食をする利用者に提示し、利用者が来店/退店時に利用者情報を登録することで、新型コロナウィルスの感染者を追跡するオプション機能「covid19 tracking」を利用することができる。ただし、本機能の利用に関しては加盟店、利用者とも任意とする。</p>
                  </section>

                  <section>
                    <h6>第18条（利用者情報の管理）</h6>
                    <ol>
                      <li>加盟店は、プライバシーポリシーに記載された目的のために当社が加盟店に、プライバシーポリシーに記載された方法で提供した会員ID及び氏名、住所、登録メールアドレス､電話番号、パスワード、LINEのアカウント等の情報（以下、「登録情報等」と言う。）（以下、会員IDと登録情報等を合わせて「会員情報」と言う。）を、必要最小限度の申込者の役員、従業員ないし派遣社員、アルバイト等（以下「従業員等」と言う。）にのみ取り扱わせるものとし、加盟店は、加盟店の従業員等による会員情報の外部への持ち出し、漏えい、又は盗用をさせてはならないものとする。</li>
                      <li>加盟店は、プライバシーポリシーに記載された目的以外の目的で利用してはならないものとする。</li>
                      <li>加盟店は、本規約に基づく契約期間の終了後直ちに、当社が提供した会員情報（その加工、複製物を含む。）を削除、返還又は破棄しなければならない。当社が要求する場合も同様とする。</li>
                      <li>プライバシーポリシーに記載された目的のために当社が加盟店に提供する会員情報について情報漏えいなど事故が生じたとしても、当社は一切責任を負わず、加盟店は当該事故により当社が被った損害（弁護士費用を含む。）を補償しなければならない。</li>
                    </ol>
                  </section>

                  <section>
                    <h6>第19条（法令遵守）</h6>
                    <p>加盟店は、テイクアウト商品の提供その他本サービスの利用に関して、食品衛生法及び食品表示法その他適用される法令等を遵守するものとする</p>
                  </section>

                  <section>
                    <h6>第20条（禁止事項）</h6>
                    <ol>
                      <li>
                        加盟店は、以下の行為を行ってはならない。
                        <ol>
                          <li>法令の定めに違反する行為又はそのおそれのある行為</li>
                          <li>公序良俗に反する行為</li>
                          <li>日本通信販売協会が定める広告に関する自主基準に違反する行為</li>
                          <li>会員又は第三者の判断に誤解を与えるおそれのある行為</li>
                          <li>当社、他の加盟店、会員又は第三者に対し、財産権（知的財産権を含む）の侵害、名誉・プライバシーの侵害、誹謗中傷、その他の不利益を与える行為又はそのおそれのある行為</li>
                          <li>他の本サービス内店舗の宣伝、外部Webサイトへのハイパーリンク、電話・FAX・電子メールなどを利用したサイト外取引についての優遇措置の表示、その他の方法により会員を本サービス外の取引に誘引する行為</li>
                          <li>会員又は第三者の個人情報、登録情報、利用履歴情報などを、不正に収集、開示又は提供する行為</li>
                          <li>当社のサービス業務の運営・維持を妨げる行為</li>
                          <li>本サービスに記載した情報を当社の許可なく変更する行為</li>
                          <li>有害なコンピュータプログラム、メール等を本サービスに送信又は書き込む行為</li>
                          <li>サーバその他当社のコンピュータに不正にアクセスする行為</li>
                          <li>当社が別途禁止行為として定める行為</li>
                          <li>本規約に違反する行為</li>
                        </ol>
                      </li>
                      <li>加盟店は、法令により販売が禁止されている商品等、第三者の権利を侵害するおそれのある商品等、当社が別途販売禁止として加盟店に通知した商品等又は本サービスのイメージに合致しないと当社が判断した商品等の販売をすることができない。</li>
                    </ol>
                  </section>

                  <section>
                    <h6>第21条（利用停止・解除）</h6>
                    <ol>
                      <li>
                        当社は、加盟店が以下のいずれかに該当し、又は該当するおそれがあると当社が判断した場合、加盟店に対し、本サービスの提供を予告なく一時停止し、又は何らの催告を要することなく加盟店との間の利用契約を解除して、本サービスの提供を中止することができるものとする。かかる利用停止又は解除に起因して加盟店に何らかの損害が生じた場合であっても、当社は、加盟店に対し、何らの責任を負わないものとする。
                        <ol>
                          <li>本サービス利用開始後に当社が第3条第2項に定める申込拒否事由があることを知った場合</li>
                          <li>本規約に違反した場合</li>
                          <li>不正又は不当な目的をもって本サービスを利用した場合</li>
                          <li>当社の責に帰すべき理由によらず、加盟店と連絡が取れない場合</li>
                          <li>本サービスのアカウントへ1年以上アクセスしていない場合</li>
                          <li>その他、当社が不適切と判断する行為を行った場合</li>
                        </ol>
                      </li>
                      <li>当社は加盟店に対して14日前に催告することにより、加盟店の過失の有無にかかわらず、加盟店の利用を停止又は本規約を解除することができるものとする。かかる利用停止又は解除に起因して加盟店に何らかの損害が生じた場合であっても、当社は、加盟店に対し、何ら責任を負わないものとする。</li>
                    </ol>
                  </section>

                  <section>
                    <h6>第22条（非保証・免責）</h6>
                    <ol>
                      <li>当社は、本サービスに事実上又は法律上の瑕疵（安全性、信頼性、正確性、完全性、有効性、特定の目的への適合性、セキュリティなどに関する欠陥、エラーやバグ、契約の目的との不適合、権利侵害等を含むが、これらに限らない）がないことを明示的にも黙示的にも保証しない。</li>
                      <li>当社は、加盟店が本サービスを利用したことに起因して加盟店に生じたあらゆる損害について一切の責任を負わない。</li>
                    </ol>
                  </section>

                  <section>
                    <h6>第23条（機密保持）</h6>
                    <p>加盟店は、当社の機密情報（当社の顧客、製品、サービス、事業、技術、ノウハウ、アイディア、コンセプト等に関する一切の情報であって、その開示方法にかかわらず、当社が開示の際に秘密である旨を明示したものをいう）を秘密として保持するものとし、法令により開示が義務付けられる場合を除き、当社の書面による事前の承諾なく当該機密情報を第三者に開示又は漏洩してはならないものとする。</p>
                  </section>

                  <section>
                    <h6>第24条（反社会的勢力の排除）</h6>
                    <ol>
                      <li>加盟店は、自己又はその代表者、役員、実質的に経営権を有する者、従業員又は代理人（以下「関係者」という）が、現在、暴力団、暴力団員、暴力団員でなくなった時から5年を経過しない者、暴力団準構成員、暴力団関係企業、総会屋等、社会運動等標ぼうゴロ、特殊知能暴力集団等又はこれらの者と密接な関わりを有する者若しくはこれらに準じる者（以下「反社会的勢力」という）のいずれにも該当しないことを表明し、かつ、将来にわたっても該当しないことを確約するものとする。</li>
                      <li>
                        加盟店は、自ら又はその関係者が、直接的又は間接的に、以下の行為を行わないことを確約するものとする。
                        <ol>
                          <li>暴力的な要求行為</li>
                          <li>法的な責任を超えた不当な要求行為</li>
                          <li>取引に関して、脅迫的な言動（自己又はその関係者が反社会的勢力である旨を伝えることを含むが、これに限らない）をし、又は暴力を用いる行為</li>
                          <li>風説を流布し、偽計を用い又は威力を用いて当社の信用を毀損し、又は当社の業務を妨害する行為</li>
                          <li>その他前各号に準じる行為</li>
                        </ol>
                      </li>
                      <li>加盟店が前二項に定める表明事項又は確約事項のいずれかに違反することが判明した場合、当社は、何らの催告を要することなく本規約を解除して、本サービスの提供を中止することができるものとする。かかる解除に起因して加盟店に何らかの損害が生じた場合であっても、当社は、加盟店に対し、一切責任を負わないものとする。</li>
                    </ol>
                  </section>

                  <section>
                    <h6>第25条（本規約の変更）</h6>
                    <ol>
                      <li>当社は、必要に応じ、公表又は加盟店に通知する方法により、本規約を変更できるものとする。加盟店は、本規約の変更後に引き続き本サービスを利用した場合、本規約の変更に同意したものとみなす。</li>
                      <li>前項の場合、当社は、効力発生日の１か月以上前の相当な時期までに、会員に対して、変更内容及び効力発生日を通知する。但し、当該変更によるお客様の不利益の程度が軽微であると当社が判断した場合、その期間を短縮することができるものとする。</li>
                      <li>前項の規定は、規約の変更内容がお客様の一般の利益に適合する場合には適用しないものとする。</li>
                    </ol>
                  </section>

                  <section>
                    <h6>第26条 （サイト内容の変更）</h6>
                    <p>当社は､加盟店の承認を受けることなく､サイトおよび本サービス内容を変更､中止する場合がある｡また、本サービスの仕様変更、機能改善により、本規約の記述内容に変更があった場合は、その仕様及び機能を優先する。</p>
                  </section>

                  <section>
                    <h6>第27条（協議解決）</h6>
                    <p>本規約に定めのない事項又は本規約の内容について疑義が生じた場合は、当社と加盟店は誠意を持って協議解決に当たるものとする。</p>
                  </section>

                  <section>
                    <h6>第28条(準拠法及び合意管轄)</h6>
                    <p>本規約の解釈・適用は、日本国法に準拠し、本規約に係る全ての紛争については、東京簡易裁判所又は東京地方裁判所を第一審の専属的合意管轄裁判所とする。</p>
                  </section>

                  <div class="align-right t-body1 c-text-black-medium m-t-24">以上</div>

                  <div class="t-body1 c-text-black-medium m-t-24">一般社団法人シンギュラリティ・ソサエティ</div>
                  <div class="t-body1 c-text-black-medium m-t-4">2020年6月22日</div>
                  <div class="t-body1 c-text-black-medium m-t-4">最終改定</div>

                  <div class="t-body1 c-text-black-medium m-t-24">SS：有本/武藤</div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>
      <!-- Right Gap -->
      <div class="column is-narrow w-24"></div>
    </div>
  </div>
</template>

<script>
import { defaultHeader } from "../../plugins/header";

export default {
  head() {
    return {
      title: [ this.$t('pageTitle.terms.admin') || "", defaultHeader.title].join(" / "),
    };
  }
}
</script>

<style lang="scss" scoped>
section {
  @extend .t-body2;
  @extend .c-text-black-medium;
}
h6 {
  @extend .t-subtitle1;
  @extend .c-text-black-disabled;
  @extend .m-t-24;
}

p {
  @extend .m-t-16;
}
ol {
  @extend .m-t-16;
  list-style: outside;
  list-style-type: decimal;
  padding-left: 24px;
}
li {
  @extend .m-t-8;
}
ol > li > ol {
  list-style-type: lower-alpha;
}
ol > li > ol > li > ol {
  list-style-type: lower-roman;
}
</style>
