<template>
  <div>
    <!-- Article Body Area -->
    <div class="columns is-gapless">
      <!-- Left Gap -->
      <div class="column is-narrow w-24"></div>
      <!-- Center Column -->
      <div class="column">
        <div class="columns is-gaplress">
          <div class="column is-three-fifths is-offset-one-fifth">
            <div class="m-l-24 m-r-24">
              <div class="m-t-24">
                <!-- Title -->
                <div class="t-h6 c-text-black-disabled">おもちかえり.com サービス利用規約（ユーザー）</div>

                <!-- Date -->
                <!-- <div
                  class="t-subtitle1 c-text-black-disabled m-t-8"
                >{{ $t("menu.updated") }}: 2020.06.24</div>-->

                <!-- Body -->
                <div>
                  <section>
                    <h6>第1条（目的と適用範囲）</h6>
                    <p>この規約（以下「本規約」と言います。）は、一般社団法人シンギュラリティ・ソサエティ（以下「当社」と言います。）が提供するおもちかえり.comに関する全ての商品及びサービス（以下「本サービス」と言います。）の利用に関する条件を、本サービスを利用する者（以下「会員」と言います。）と当社との間で規定するものです。会員は、本規約に従っておもちかえり.comを利用しなければなりません。またおもちかえり.comを利用することにより本規約に同意したものとみなします。</p>
                  </section>

                  <section>
                    <h6>第2条（定義）</h6>
                    <ol>
                      <li>「本規約」とは、おもちかえり.comサービス利用規約（会員）、プライバシーポリシー、個別規約等をいい、これらはすべて本規約を構成するものとして適用されます。</li>
                      <li>「プライバシーポリシー」とは、当社が定めるプライバシーポリシーをいいます。「個別規約等」とは、本サービスに関する個別の規約やルール等をいいます。</li>
                      <li>当社は、本サービスの提供にあたり、必要に応じて個別規約等を作成することができ、作成した個別規約等は、当社の定める方法で本サービス上に掲載又は会員に通知するものとします。</li>
                      <li>「おもちかえり.com」とは、加盟店が本サービス上にて自己の商品を有料で提供する商品のテイクアウト、利用者の追跡、その他これに付随するサービスを提供するWEBサービスをいいます（以下、文脈に応じて「おもちかえり.com」又は「本サービス」と言います。）。</li>
                      <li>「会員」とは、本規約により当社と本サービスの利用契約（以下「利用契約」と言います。）を締結し、本サービスを利用する利用者をいいます。当社は、会員が加盟店の提供する商品を注文するシステム及びそれに付随するサービスを提供するにとどまり、商品に関する売買契約は、会員と加盟店との間で成立するものとし、当該売買契約に関しては、全て会員と加盟店間の自己責任とし、当社は一切責任を負わないものとします。</li>
                      <li>「加盟店」とは、本サービス上に自己の商品の販売を目的として商品を掲載し、会員により注文がなされたときに会員に対して商品をテイクアウトの形式で提供する者をいいます。</li>
                      <li>「商品」とは、会員が「おもちかえり.com」を利用することで加盟店から購入可能な商品の総称をいい、テイクアウトの方法により購入する商品を「テイクアウト商品」といいます。</li>
                      <li>「心づけ」とは、会員が当サイト上､当サイトの加盟店に対し注文行為を行うにあたり、商品の代金に加えて、商品の提供に係るサービスの対価として、加盟店に対して支払われる金銭をいいます。</li>
                    </ol>
                  </section>

                  <section>
                    <h6>第３条 入会及び退会の手続き</h6>
                    <ol>
                      <li>
                        入会希望者は、本サービスの入会手続きにあたって、以下の各号のいずれの場合にも該当しないことを表明します。
                        <ol>
                          <li>未成年者で親権者の同意を得ていない場合</li>
                          <li>過去に会員資格を抹消されている場合</li>
                          <li>申し込みの際に届け出る内容に、虚偽、不正、二重登録、誤記、又は記入漏れがある場合</li>
                          <li>満14歳未満の者</li>
                          <li>反社会的勢力 （暴力団、暴力団員、暴力団員でなくなった時から5年を経過しない者、暴力団準構成員、暴力団関係企業、総会屋等、社会運動等標榜ゴロ、特殊知能暴力集団等又はこれらに準じる者をいいます。以下同じ）に該当する場合、その経営に反社会的勢力が実質的に関与していると認められる場合、反社会的勢力を利用していると認められる場合、反社会的勢力に対して資金等を提供し若しくは便宜を供与するなどの関与をしていると認められる場合、又は、反社会的勢力と社会的に非難されるべき関係を有している場合</li>
                          <li>その他、当社が不適当と判断する事由がある場合</li>
                        </ol>
                      </li>
                      <li>当社は、会員が本規約の内容に違反（前項による表明が真実又は正確でないこと、本規約規定の禁止行為を行うことを含みますが、これらに限りません。以下同じ）していると判断した場合、何らの通知なしに、直ちに当該会員について強制的に退会手続をすることができるものとします。なお、退会処理後に当社が当該会員の復帰を許可した場合も、復帰前のアカウントに紐付く情報は消滅し、会員からの要望があったとしても、補填や復元等はしないものとします。</li>
                      <li>会員は、当サイト上の規定のページより当社に退会の申し出をすることにより、おもちかえり.comの登録を抹消することができます。ただし、退会は、退会前に行ったテイクアウト商品の注文・代金決済等には影響を与えないものとします。当社は、二重登録や不正防止の目的に限り会員が退会した後でも氏名と電話番号の情報は保持するものとし、会員はこれに同意するものとします。</li>
                    </ol>
                  </section>

                  <section>
                    <h6>第４条 規約の適用</h6>
                    <p>本規約は､当サイトにおける､第１条が定める会員との間のあらゆる関係において適用されます｡</p>
                  </section>

                  <section>
                    <h6>第５条 規約の変更</h6>
                    <ol>
                      <li>当社は､規約等(本規約および当サイトに掲載するサービスに関するルール､諸規定等を含みます｡以下本規約において同じ｡)の内容を変更できるものとします｡</li>
                      <li>前項の場合、当社は、効力発生日の１か月以上前の相当な時期までに、会員に対して、変更内容及び効力発生日を通知します。但し、当該変更によるお客様の不利益の程度が軽微であると当社が判断した場合、その期間を短縮することができるものとします。</li>
                      <li>前項の規定は、規約の変更内容がお客様の一般の利益に適合する場合には適用しないものとします。</li>
                    </ol>
                  </section>

                  <section>
                    <h6>第６条 利用規約の遵守</h6>
                    <p>会員は､規約等(前条により変更された場合は､変更後の規約等も含む｡)を理解し遵守する義務があります｡</p>
                  </section>

                  <section>
                    <h6>第７条 プライバシー</h6>
                    <ol>
                      <li>会員は、会員が本サービス利用にあたり当社に提供した会員ID及び氏名、住所、登録メールアドレス､電話番号、パスワード、LINEのアカウント等の情報（以下「登録情報等」と言います。）を当社がプライバシーポリシーに記載された目的のために取得し、保有することについてあらかじめ同意するものとし、当社は当該情報について責任をもって管理･保護します｡ただし、決済で入力した情報等につきましては、オンライン決済プラットフォームのストライプジャパン株式会社が取得するものであり、ストライプジャパン株式会社が管理しますので、当社では一切責任を負いません。また､会員は会員ID及び登録情報等については､プライバシーポリシーに従って取扱うことにあらかじめ同意するものとします｡なお、かかるプライバシーポリシーが変更された場合､会員は変更後のプライバシーポリシーが適用されることに予め同意するものとします｡</li>
                      <li>会員は、プライバシーポリシーに記載された目的のために、当社が加盟店に会員ID及び登録情報等を、会員からの注文の際にプライバシーポリシーに記載された方法で提供することに予め同意します。</li>
                      <li>当社が裁判所、警察等の公的機関から開示、情報提供を要求された場合及び法令に基づく請求を受けた場合は、会員の承諾を得ずにこれに応じる場合があります。</li>
                    </ol>
                  </section>

                  <section>
                    <h6>第８条 登録情報等の管理</h6>
                    <ol>
                      <li>当社が本サービスを提供するにあたって、会員IDまたは登録情報等を利用することにより、会員に損害が発生したとしても､会員は、自らの責任､および費用負担によって解決するものとし､当社は一切責任を負いません｡</li>
                      <li>会員IDまたは登録情報等の管理は､会員の責任において行われるものとします｡会員IDまたは登録情報等が第三者によって使用され､会員に不利益､損害が発生した場合であっても､当社は一切その責任を負いません｡</li>
                      <li>会員が会員IDまたは登録情報等を喪失し､もしくは盗難した場合（以下、このような事態を「会員ID等の喪失等」と言います。）､会員はただちに当社に報告するものとし､その報告があった場合や会員からの報告がなくとも当社が会員ID等の喪失等に気づいた場合には､会員IDまたは登録情報等の使用を中止することがあります｡</li>
                      <li>登録情報等の登録は､会員が自らの責任により行うものとし､登録情報等の入力間違いにより､第三者に会員情報等が送信され､不正に利用された 場合であっても､当社は一切その責任を負いません｡また､登録情報等の入力間違いにより､第三者に対して損害や損失を与えた場合､会員は自己の責任と 費用負担によってその損害･損失を処理･解決するものとし､当社は､かかる損害･損失に対して如何なる責任も負いません｡</li>
                    </ol>
                  </section>

                  <section>
                    <h6>第９条 メール等の送受信</h6>
                    <ol>
                      <li>会員は､会員として当社に電子メール、SMS、LINE、その他の電子的な連絡手段（以下、「メール等」と言います。）により送信する場合､事前に登録したメールアドレス、電話番号、LINEのアカウント等（以下、「通信用情報」と言います。）を使用するものとします｡</li>
                      <li>会員が､事前に登録した通信用情報と異なる通信用情報にて送受信を行い､第三者に不利益､損害が発生したとしても､当社は一切その責任を負いません｡</li>
                      <li>会員は､当社が会員へ送信するメール等のうち､サービスの追加・変更・停止等に関するお知らせ､会員限定企画や会員向けサービスの評価を依頼する場合など､当社が特に重要度が高いと判断する「重要なお知らせ」に関しては､配信を停止することが出来ないことを予め了承するものとします｡</li>
                      <li>当社および加盟店は会員に対して､店舗からのお知らせやお得な情報をメール等にて配信することがあり､これについて会員はあらかじめ同意するものとします｡ただし､会員がメール等内に記載の配信停止方法に従ってこのメール等の配信停止を希望した場合､当社はメール等の配信停止を行うものとします。なお、配信停止までの期間についてはできる限り速やかに対応する予定ですが、当社がその期間について何らの保証をしないことを会員は予め了承するものとします。</li>
                    </ol>
                  </section>

                  <section>
                    <h6>第１０条 注文情報の受付</h6>
                    <ol>
                      <li>会員が当サイト上､当サイトの加盟店に対し注文行為を行うにあたり、商品の代金に加えて、商品の代金の30％を上限として「心づけ」の支払いを行うことができるものとします。</li>
                      <li>会員が当サイト上､当サイトの加盟店に対し注文行為を行うと、当サイト上にて「注文済み」が表示されます。</li>
                      <li>加盟店がその注文情報の受付を承認した場合､当サイト上にて「受付済み」が表示され､その表示をもって受付を完了したものとします｡受付を完了した後の商品のキャンセルはできませんのでご注意ください。なお、本サービスは会員に対して、受付の完了をメール等の送信をもって自動で通知します。</li>
                      <li>加盟店で調理が完了しご注文のテイクアウト商品のお渡しが可能となった場合、本サイトにて「調理済み」が表示されます。オンライン決済の場合、その表示をもって取引の決済が完了することとなります｡なお、本サービスは会員に対して、ご注文の商品のお受け渡しが可能になったことをメール等の送信をもって自動で通知します。</li>
                      <li>会員は調理済みの表示からテイクアウト時間までに、加盟店が指定した店舗にてテイクアウト商品のお受け取りをお願いします。調理済みの表示から2時間を経過してもお受け取りに来られない場合は、商品のお引き渡しは完了したものとみなします。また、これにより発生した一切の損害について､当社は如何なる責任も負わないものとし、加盟店は、会員の受け取りを妨害するなど、会員が受領できなかったことについて故意または重過失ある場合に限って、会員に生じた損害のうち、通常生ずべき損害についてのみ責任を負うものとします。</li>
                      <li>会員は､メール等による受付完了および調理済みの通知に関し､理由の如何を問わず､送信失敗､遅延､未着が発生する場合がある旨を予め了承するものとし､当社は､これにより発生した一切の損害について､如何なる責任も負わないものとし、加盟店は、送信失敗等の発生につき、故意または重過失ある場合に限って、会員に生じた損害のうち、通常生ずべき損害についてのみ責任を負うものとします｡</li>
                    </ol>
                  </section>

                  <section>
                    <h6>第１１条（利用者追跡機能の利用）</h6>
                    <p>加盟店は、当社が提供するQRコードを店内で飲食をする会員に提示し、会員が来店/退店時に会員の個人情報を登録することで、新型コロナウィルスの感染者を追跡するオプション機能「covid19 tracking」を利用することができる。ただし、本機能の利用に関しては加盟店、会員者とも任意とする。</p>
                  </section>

                  <section>
                    <h6>第１２条 不適切利用が確認された場合の会員情報の取扱い・対応</h6>
                    <p>
                      当社は、本サービスにおいて不適切利用（本規約第１３条・第１４条・第２０条各号に該当するものをいいます）が確認された場合、加盟店対し、当該不適切利用にかかるお客さまの情報を提供するものとし、会員は予めそれについて事前に承認するものとします。
                      本サービスの加盟店は、当社から提供を受けたお客さまの情報を、加盟店における不適切利用の防止に必要な範囲内で利用するものとします。
                    </p>
                    <p>なお、加盟店において不適切利用が確認された場合、加盟店から当社にお客さまの情報を提供されることがあり、その場合、お客さまは本サービスを利用できなくなることがあります。</p>
                  </section>

                  <section>
                    <h6>第１３条 禁止事項および会員登録の抹消･利用停止</h6>
                    <ol>
                      <li>
                        会員は以下の行為を行ってはならないものとします。
                        <ol>
                          <li>本規約に違反する行為</li>
                          <li>不正な方法により商品を取得しようとする行為</li>
                          <li>会員ID及び本サービスアカウントデータを貸与、交換、譲渡、名義変更、売買、質入、担保供与その他の方法により第三者に利用させ、又は処分する行為</li>
                          <li>本サービスによって提供され取得した商品等を営利目的で転売する行為</li>
                          <li>当社、加盟店、他の会員又は第三者に不利益若しくは損害を与える行為、又はそれを助長する行為</li>
                          <li>法令、条例等に違反する行為、又はそれを助長する行為</li>
                          <li>犯罪行為、公序良俗に反する行為、又はそれを助長する行為</li>
                          <li>本サービスへの不正アクセス、コンピューターウィルス等による運営妨害</li>
                          <li>他人の名誉、信用、プライバシー、著作権その他の権利を侵害する行為、又はそれを助長する行為</li>
                          <li>年齢若しくは身分を偽る行為、又は本サービスの利用にあたって虚偽の情報を申告する行為</li>
                          <li>他人の名前を登録名として選択又は使用し、その人になりすます行為</li>
                          <li>本人以外の人又は団体の名前を適切な許可を得ずに使用し、その権利を侵害する行為</li>
                          <li>低俗、猥褻な名前を使用し、他人に不快感を与える行為</li>
                          <li>一切の加工行為を通じて本サービスを分解、変更、模倣する行為</li>
                          <li>当社の同意なく、本サービスを営利的に使用する行為</li>
                          <li>猥褻、暴力的な情報等を表示する行為</li>
                          <li>当社、加盟店、他の会員又は第三者に対する不当な差別、誹謗中傷、脅迫、その他、不安・不快にさせる言動や行為・行動</li>
                          <li>当社、加盟店、他の会員又はその他の第三者に対する詐欺又は脅迫行為</li>
                          <li>加盟店への営業妨害行為又は迷惑行為</li>
                          <li>その他、当社が不適切と判断する行為</li>
                        </ol>
                      </li>
                      <li>会員が前項に定める禁止行為を行ったと当社が判断した場合、 当社は当該会員に通知することなく、直ちに該当箇所の削除や、当該会員に対する本サービスの提供を中止することができるものとします。また、必要性があると当社が判断した場合には、裁判所、 検察庁、警察、地方自治体、その他法律や条例などで認められた権限を持つ機関に、当該会員の許可なく利用情報を開示・提供することができるものとします。なお､これにより会員が何らかの損害を被ったとしても当社は一切責任を負うものではありません。</li>
                    </ol>
                  </section>

                  <section>
                    <h6>第１４条 損害･損失処理の責任</h6>
                    <ol>
                      <li>会員が当サイトの利用によって第三者に対して損害や損失を与えた場合､会員は自己の責任と費用負担によってその損害･損失を処理･解決するものとし､当社は､かかる損害･損失に対して如何なる責任も負いません｡</li>
                      <li>会員が本規約に違反した行為､あるいは不正､または違法な行為により当サイトおよび他の会員に損害を与えた場合､当社は､当該会員に対して相応の損害賠償請求を行う権利をも有します｡</li>
                      <li>当社と会員との利用契約が消費者契約法第２条第３項に定める消費者契約に該当する場合､本規約のうち､当社の損害賠償責任を完全に免責する規定は適用されないものとし､当社はかかる規定に定める会員に発生した損害が当社の債務不履行もしくは不法行為または担保責任（契約内容不適合）に基づく場合には､当社に故意または重過失がある場合に限って、それによる直接かつ通常の損害について損害賠償責任を負うものとします｡</li>
                    </ol>
                  </section>

                  <section>
                    <h6>第１５条 入手情報の使用</h6>
                    <p>会員は､当社が事前に承認した場合を除き､当サイトを通じて入手した如何なる情報についても､会員個人としての私的使用以外の目的に使用しないものとします｡</p>
                  </section>

                  <section>
                    <h6>第１６条 著作権</h6>
                    <ol>
                      <li>当サイトの著作権(著作権法第２７条及び第２８条の権利を含む｡以下同じ｡)は､当社に所属します｡この著作権の対象には､サイトの構成､デザイン､イラスト･写真等のグラフィクス､文章など､すべてを含みます (但し､各加盟店ページ等に掲載する店舗情報･メニュー情報･写真データ等の著作権については、各加盟店に帰属しし､当社がその使用許諾を受けたものが含まれます｡)。</li>
                      <li>当サイトに掲載された会員からの投稿その他の著作物の著作権は､当社に属するものとし､掲載されている投稿その他の著作物のすべて､あるいは一部を投稿者以外の第三者が当社､および投稿者に無断で転載･再配布することを禁止いたします｡また､会員は､当サイトに掲載された投稿その他の著作物について､著作者人格権を一切行使しないものとします｡</li>
                    </ol>
                  </section>

                  <section>
                    <h6>第１７条 サイト内容の変更</h6>
                    <ol>
                      <li>当社は､会員の承認を受けることなく､サイトおよび本サービス内容を変更､中止する場合があります｡また、本サービスの仕様変更、機能改善により、本規約の記述内容に変更があった場合は、その仕様及び機能を優先します。</li>
                      <li>このような事態に伴い､会員に不利益､損害が発生した場合でも､当社はその責任を一切負いません｡</li>
                    </ol>
                  </section>

                  <section>
                    <h6>第１８条 サービスの中断､停止</h6>
                    <p>当社では以下に該当する場合､会員の承諾なしにサービスの一部､もしくはすべてを一時中断､または停止する場合があります｡</p>
                    <ol>
                      <li>当サイト､ネットワークのシステム保守､更新､ならびに緊急の場合</li>
                      <li>火災､停電､天災などの不可抗力により､サービスの提供が困難となった場合</li>
                      <li>その他不測の事態により､当サイトのサービス提供が困難であると当社が判断した場合</li>
                    </ol>
                  </section>

                  <section>
                    <h6>第１９条 本規約の譲渡</h6>
                    <p>当社は､サービスにかかる事業を第三者に譲渡した場合には､会員の書面による事前の承諾なく､当該事業譲渡に伴い､本規約に基づく権利もしくは義務につき､第三者に対し､譲渡､移転､担保設定､その他の本規約に基づく権利及び義務並びに会員の登録事項その他の顧客情報を当該事業譲渡の譲受人に譲渡することができるものとし､会員は､かかる譲渡につき本条において予め同意したものとします｡なお､本条に定める事業譲渡には､通常の事業譲渡のみならず会社分割その他事業が移転するあらゆる場合を含むものとします｡</p>
                  </section>

                  <section>
                    <h6>第２０条 免責事項</h6>
                    <ol>
                      <li>当社は会員に対して通知義務を負う場合は､会員があらかじめ登録した電話番号またはメールアドレス、LINEのアカウントへ通知を発信することにより､その義務を果たしたものとします｡会員は､登録メールアドレスへのメール送信は､理由の如何を問わず､送信失敗､遅延､未着が発生する場合がある旨を予め了承するものとし､当社は､これにより発生した一切の損害について､如何なる責任も負わないものとします｡</li>
                      <li>当社は､会員がサービスを利用できなかったことにより発生した一切の損害について､如何なる責任も負わないものとします｡</li>
                      <li>当社が会員に対し､注文情報の受け付けを承認した旨告知した後､加盟店もしくは､当社の都合で注文を承れない事由が発生した場合､加盟店もしくは､当社より会員へ当該注文のキャンセルを通知する場合があり、会員はそれにつき、予め了承するものとします。</li>
                      <li>会員の当サイトでの加盟店との取引は､全て会員と､加盟店との間で行うものです｡したがって､万一加盟店との取引に関してトラブルが生じた場合、当社は一切責任を負わず、会員と加盟店との間で解決することとします｡</li>
                      <li>当社は､当社によるサービスの提供の中断､停止､利用不能または変更､会員のメッセージまたは情報の削除または消失､会員の会員登録の取消､注文のキャンセル､サービスの利用によるデータの消失または機器の故障もしくは損傷､その他サービスに関連して会員が被った損害につき､賠償する責任を一切負わないものとします｡</li>
                      <li>当サイトから他のサイトへのリンクまたは他のサイトから当サイトへのリンクが提供されている場合であっても､当社は､当サイト以外のサイト及びそこから得られる情報に関して如何なる理由に基づいても一切の責任を負わないものとします｡</li>
                      <li>コンピューター･ウィルスその他の有害なコンピューター･プログラムを含む情報の送受信が行われたことに基づく会員の損害については､当社は一切の責任を負わないものとします｡</li>
                      <li>加盟店の情報及び商品に関するアレルギー情報･カロリー情報･商品説明などの各種掲載情報につきまして､当社はその正確性､正当性､有用性など如何なる保証しないものとしません｡</li>
                      <li>サーバ、システム等の故障が生じた場合及び定期・不定期のメンテナンスのために、システムの全部または一部の休止に基づく会員の損害については､当社は一切の責任を負わないものとします｡</li>
                    </ol>
                  </section>

                  <section>
                    <h6>第２１条 準拠法及び管轄裁判所</h6>
                    <p>本規約の準拠法は日本法とし､本規約に起因しまたは関連する一切の紛争については､東京簡易裁判所又は東京地方裁判所を第一審の専属的合意管轄裁判所とします｡</p>
                  </section>

                  <div class="align-right t-body1 c-text-black-medium m-t-24">以上</div>

                  <div class="t-body1 c-text-black-medium m-t-24">一般社団法人シンギュラリティ・ソサエティ</div>
                  <div class="t-body1 c-text-black-medium m-t-4">2020年6月22日</div>
                  <div class="t-body1 c-text-black-medium m-t-4">最終改定</div>

                  <div class="t-body1 c-text-black-medium m-t-24">SS：有本/武藤</div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>
      <!-- Right Gap -->
      <div class="column is-narrow w-24"></div>
    </div>
  </div>
</template>

<script>
import { defaultHeader } from "../../plugins/header";

export default {
  head() {
    return {
      title: [ this.$t('pageTitle.terms.user') || "", defaultHeader.title].join(" / "),
    };
  }
}
</script>

<style lang="scss" scoped>
section {
  @extend .t-body2;
  @extend .c-text-black-medium;
}
h6 {
  @extend .t-subtitle1;
  @extend .c-text-black-disabled;
  @extend .m-t-24;
}

p {
  @extend .m-t-16;
}
ol {
  @extend .m-t-16;
  list-style: outside;
  list-style-type: decimal;
  padding-left: 24px;
}
li {
  @extend .m-t-8;
}
ol > li > ol {
  list-style-type: lower-alpha;
}
ol > li > ol > li > ol {
  list-style-type: lower-roman;
}
</style>
